[ 
 
{
  "title": "“My character is the personification of greed,” says Manav Gohil from COLORS’ ‘Binddii’",
  "excerpt": "No prison wall is strong enough to cage a mother’s spirit. COLORS brings a stirring tale of love, betrayal, and resilience in its new drama Binddii.",
  "content": "No prison wall is strong enough to cage a mother’s spirit. Carrying forward its legacy of fearless and raw sagas, COLORS brings a stirring tale of love, betrayal, and resilience in its new drama Binddii.\n\nBorn behind bars, Binddii’s world begins and ends with her mother Kajal, whose warmth turns a prison cell into her haven. But when fate pulls her into the outside world, she is thrown into a ruthless battle where survival is the only choice.\n\nIn the heart of Mathura, Binddii discovers the bitter truth: her father Aviraj’s lies for mafia don Dayanand Chaudhury’s thirst for power shattered her mother’s life. As danger looms and enemies circle once again, Binddii must summon the courage to defy them all and fight for her mother’s freedom.\n\nStarring Radhika Muthukumar as Kajal, Saachi Bhoyar as Binddii, Krushal Ahuja as Aviraj, and Manav Gohil as Dayanand, Binddii airs every day at 8:30 pm on COLORS and JioHotstar.\n\nExcerpts from Manav Gohil’s interview:\n\n1. Tell us about the show.\nA. Binddii is the saga of a daughter’s fight for her imprisoned mother. Born and raised inside prison walls, Binddii’s only world is Kajal, whose love turns iron bars into a haven of joy and hope. But their fragile happiness is shattered when the law forces Binddii out, leaving her unprotected and alone in a hostile world she has never known. When her uncle Saurav takes her to his home in Mathura, the past begins to resurface. She discovers that her father, Aviraj, had conned Kajal, conspiring with the ruthless mafia don Dayanand Chaudhury for money and power. Determined to right these wrongs, Binddii sets out to educate herself and one day free her mother, but the challenge is that Aviraj and Dayanand are closing in on the mother-daughter. The story rides on her inspiring journey to fight this impossible battle that is tilted in favour of the powerful.\n\n2. What drew you to Binddii and your role in particular?\nA. Dayanand Chaudhury is one of those characters who frightens you with their unpredictability. He started as a petty criminal, always scheming for shortcuts to wealth, and over the years, he’s built himself into a mafia don who wears the mask of a respectable man. And yet, for all his darkness, he has this very human layer - his love for his son. He uses acts of kindness as stepping stones for political power. My character is the personification of greed.\n\n3. The show exposes how greed can destroy families. Do you think audiences will see shades of their surroundings in this story?\nA. Absolutely. Greed isn’t only measured in money. It shows up in everyday choices where personal gain outweighs relationships. Most families have seen it in some form. Binddii mirrors this reality through its characters, and audiences will connect with the show.\n\n4. Each character represents a side of society - nurturing, innocent and corrupt. Which side has the upper hand?\nA. Greed and corruption may seem powerful in the moment; yet over time, it is love, innocence, and justice that truly prevail. Families cannot thrive on greed, and societies cannot recover through corruption; they survive because of compassion, resilience, and the fight for what’s right.\n\n5. Dayanand seems like an outright evil man. How did you ensure he feels menacing yet believable?\nA. The scariest kind of evil is the one that doesn’t announce itself. Real menace hides in restraint, in silence, in the ability to look you in the eye and never flinch. His danger lies in his conviction - he doesn’t second-guess, he doesn’t apologise, he doesn’t feel guilt.\n\n6. You’ve played a range of roles over your career. What makes Dayanand stand apart from the others?\nA. Most of the characters I’ve portrayed had a shade of humanity. Dayanand is different. He doesn’t seek your sympathy, he doesn’t need validation, and he certainly doesn’t have a redemptive bone in his body. He thrives on destruction and power.\n\n7. What is scarier: a villain with no remorse or one who justifies every action as ‘necessary’?\nA. Without doubt, a villain who justifies every action. That kind of character doesn’t just harm you, he convinces you that the harm is for your own good.\n\n8. Dayanand thrives on corruption and control. Did you base him on real-world figures?\nA. The world around us gives an actor plenty of raw material. Dayanand is stitched together from fragments of people we’ve seen: politicians, businessmen, and power brokers.\n\n9. Do you see Dayanand as a mirror of real-world power brokers?\nA. Dayanand isn’t fiction; he reflects our society where unchecked ambition mutates into corruption.\n\n10. What is your message to viewers?\nA. I want to thank the audience for the overwhelming response to Binddii. Dayanand may represent everything we dislike in power, but Binddii represents the courage and innocence we need to protect. Keep watching Binddii, every day at 8:30 PM on COLORS and JioCinema.\n\nWitness a daughter’s warrior spirit and a mother’s love that defies all chains in ‘Binddii’; airs every day at 8:30 pm only on COLORS.",
  "category": "Entertainment",
  "imageUrl": "/images/bindi2.png",
  "tags": ["Binddii", "COLORS TV", "Manav Gohil", "Interview"],
  "isTopStory": true,
  "isTrending": true,
  "id": "binddii-001",
  "slug": "binddii-manav-gohil-interview",
  "author": {
    "name": "Telly Filmy",
    "avatarUrl": "/Public/logo.png"
  },
  "date": "2025-09-21T12:30:00.000Z",
  "views": 0
}
,


{
    "title": "The cast and crew of Dangal TV’s show Pati Brahmachari came together on the sets to celebrate the completion of 100 episodes",
    "excerpt": "Dangal TV’s popular show Pati Brahmachari has successfully reached the 100-episode mark, celebrating its entertaining blend of drama, romance, and family emotions that continue to keep audiences hooked... ",
    "content": "Starring Prapti Shukla as Isha and Ashish Dixit as Sooraj, the series has built a loyal fan base with its engaging storyline and relatable characters. With memorable performances, strong chemistry between the leads, and consistent viewer support, Pati Brahmachari has cemented its place as one of the most loved primetime shows on television and on digital platforms.                                     Prapti Shukla, who brings Isha’s character to life, shared her joy on the 100-episode celebration, saying, “Reaching this milestone feels surreal. From day one, the entire team has put their heart into the show, and seeing the audience connect with our story so deeply is the biggest reward. Every compliment and every bit of support keep us motivated to give our best.                                             Ashish Dixit, seen as Sooraj in the show, added, “Completing 100 episodes is not just a number—it’s a testimony to the love our viewers have showered on us. Working on this show has been a memorable journey filled with learning, growth, and immense appreciation. I feel proud to be part of a project that entertains and touches hearts simultaneously. A big thank you to the viewers and the channel for making this possible.                                         Join us in celebrating Pati Brahmachari as it marks the milestone of 100 episodes!",
    "category": "Entertainment",
    "imageUrl": "/images/pbc.jpeg",
    "tags": [
      "Dangal Tv"
    ],
    "isTopStory": true,
    "isTrending": true,
    "imageHint": "custom image",
    "id": "11252sav",
    "slug": "patibc",
    "author": {
      "name": "Telly Filmy",
      "avatarUrl": "/Public/logo.png"
    },
    "date": "2025-09-17T16:59:38.877Z",
    "views": 0
  },
{
    "title": "Marathi Star Sanchi Bhoyar opens up about learning Mathura’s Brijbhasha for her Hindi TV debut in COLORS’ ‘Binddii’",
    "excerpt": "They say language is the road map of culture. For child actor Sanchi Bhoyar, who earlier charmed audiences in Marathi with Indrayani, learning Brijbhasha in Mathura became the compass for her first Hindi lead role in COLORS’ ‘Binddii’. ",
    "content": "They say language is the road map of culture. For child actor Sanchi Bhoyar, who earlier charmed audiences in Marathi with Indrayani, learning Brijbhasha in Mathura became the compass for her first Hindi lead role in COLORS’ ‘Binddii’.Starring alongside Radhika Muthukumar, the show follows the story of a young girl born behind bars, who grows up wrapped in her mother Kajal’s love inside prison, and then has to face the unfamiliar world outside. Set in Mathura, Binddii’s world pulses with the rhythms of its local dialect, which is why Sanchi’s preparation to learn brijbhasha was crucial. Speaking in Brijbhasha doesn’t just ground Binddii to the soil of Mathura but it also makes her dreams and challenges feel real, whether it’s going to school or fighting for her mother’s freedom.Sanchi Bhoyar, playing titular role in COLORS’ Binddii, shares, “This is my very first Hindi television show, so everything feels new and exciting for me. To play Binddii, I had to not only understand her emotions but also learn Brijbhasha, which is spoken in Mathura. At first, it was challenging, because the words and tone are different from both Marathi and Hindi but since we were shooting in Mathura, I began picking up the words directly from the people there. Simple things like saying Radhe Radhe (hello) or calling Radhika ma’am, who is playing my on-screen mother, Maiyya, made me feel like I was living in Binddii’s world. These little words made Binddii real for me, I started feeling closer to her world, and I believe  my efforts will make her journey more real for the viewers",
    "category": "Entertainment",
    "imageUrl": "/images/bindi1.jpeg",
    "tags": [
      "TV"
    ],
    "isTopStory": true,
    "isTrending": true,
    "imageHint": "custom image",
    "id": "5254hnhv",
    "slug": "bindinn",
    "author": {
      "name": "Telly Filmy",
      "avatarUrl": "/Public/bindi.jpeg"
    },
    "date": "2025-09-17T16:59:38.877Z",
    "views": 0
  }, 
  {
    "title": "No one plays the non-fiction game like COLORS!",
    "excerpt": " ",
    "content": "No one plays the non-fiction game like COLORS! With Bigg Boss 19 sparking conversations and Pati Patni Aur Panga winning hearts, COLORS rules the ratings.Stay Tuned to COLORS for more fun and exciting shows",
    "category": "Entertainment",
    "imageUrl": "/images/bb19.jpeg",
    "tags": [
      "News"
    ],
    "isTopStory": true,
    "isTrending": true,
    "imageHint": "custom image",
    "id": "14525fdsgf",
    "slug": "testing",
    "author": {
      "name": "Telly Filmy",
      "avatarUrl": "/Public/logo.png"
    },
    "date": "2025-09-17T16:59:38.877Z",
    "views": 0
  },

  {
    "title": "Dangal TV Channel Ranked No.1 on YouTube Globally",
    "excerpt": "Dangal TV Channel Ranked No.1 on YouTube Globally as per Tubular Leaderboard in Media & Entertainment and Films & Movies Categories ",
    "content": "Dangal TV, one of India’s leading entertainment brands, has set yet another benchmark on the global stage.",
    "category": "Entertainment",
    "imageUrl": "/images/post1.jpeg",
    "tags": [
      "News"
    ],
    "isTopStory": true,
    "isTrending": true,
    "imageHint": "custom image",
    "id": "27lrft5c1xz",
    "slug": "bb",
    "author": {
      "name": "Telly Filmy",
      "avatarUrl": "/Public/logo.png"
    },
    "date": "2025-09-17T16:59:38.877Z",
    "views": 0
  }
]