[ 
  {
    "title": "The cast and crew of Dangal TV’s show Pati Brahmachari came together on the sets to celebrate the completion of 100 episodes",
    "excerpt": "Dangal TV’s popular show Pati Brahmachari has successfully reached the 100-episode mark, celebrating its entertaining blend of drama, romance, and family emotions that continue to keep audiences hooked... ",
    "content": "Starring Prapti Shukla as Isha and Ashish Dixit as Sooraj, the series has built a loyal fan base with its engaging storyline and relatable characters. With memorable performances, strong chemistry between the leads, and consistent viewer support, Pati Brahmachari has cemented its place as one of the most loved primetime shows on television and on digital platforms.                                     Prapti Shukla, who brings Isha’s character to life, shared her joy on the 100-episode celebration, saying, “Reaching this milestone feels surreal. From day one, the entire team has put their heart into the show, and seeing the audience connect with our story so deeply is the biggest reward. Every compliment and every bit of support keep us motivated to give our best.                                             Ashish Dixit, seen as Sooraj in the show, added, “Completing 100 episodes is not just a number—it’s a testimony to the love our viewers have showered on us. Working on this show has been a memorable journey filled with learning, growth, and immense appreciation. I feel proud to be part of a project that entertains and touches hearts simultaneously. A big thank you to the viewers and the channel for making this possible.                                         Join us in celebrating Pati Brahmachari as it marks the milestone of 100 episodes!",
    "category": "Entertainment",
    "imageUrl": "/images/pbc.jpeg",
    "tags": [
      "Dangal Tv"
    ],
    "isTopStory": true,
    "isTrending": true,
    "imageHint": "custom image",
    "id": "11252sav",
    "slug": "patibc",
    "author": {
      "name": "Telly Filmy",
      "avatarUrl": "/Public/logo.png"
    },
    "date": "2025-09-17T16:59:38.877Z",
    "views": 0
  },
{
    "title": "Marathi Star Sanchi Bhoyar opens up about learning Mathura’s Brijbhasha for her Hindi TV debut in COLORS’ ‘Binddii’",
    "excerpt": "They say language is the road map of culture. For child actor Sanchi Bhoyar, who earlier charmed audiences in Marathi with Indrayani, learning Brijbhasha in Mathura became the compass for her first Hindi lead role in COLORS’ ‘Binddii’. ",
    "content": "They say language is the road map of culture. For child actor Sanchi Bhoyar, who earlier charmed audiences in Marathi with Indrayani, learning Brijbhasha in Mathura became the compass for her first Hindi lead role in COLORS’ ‘Binddii’.Starring alongside Radhika Muthukumar, the show follows the story of a young girl born behind bars, who grows up wrapped in her mother Kajal’s love inside prison, and then has to face the unfamiliar world outside. Set in Mathura, Binddii’s world pulses with the rhythms of its local dialect, which is why Sanchi’s preparation to learn brijbhasha was crucial. Speaking in Brijbhasha doesn’t just ground Binddii to the soil of Mathura but it also makes her dreams and challenges feel real, whether it’s going to school or fighting for her mother’s freedom.Sanchi Bhoyar, playing titular role in COLORS’ Binddii, shares, “This is my very first Hindi television show, so everything feels new and exciting for me. To play Binddii, I had to not only understand her emotions but also learn Brijbhasha, which is spoken in Mathura. At first, it was challenging, because the words and tone are different from both Marathi and Hindi but since we were shooting in Mathura, I began picking up the words directly from the people there. Simple things like saying Radhe Radhe (hello) or calling Radhika ma’am, who is playing my on-screen mother, Maiyya, made me feel like I was living in Binddii’s world. These little words made Binddii real for me, I started feeling closer to her world, and I believe  my efforts will make her journey more real for the viewers",
    "category": "Entertainment",
    "imageUrl": "/images/bindi1.jpeg",
    "tags": [
      "TV"
    ],
    "isTopStory": true,
    "isTrending": true,
    "imageHint": "custom image",
    "id": "5254hnhv",
    "slug": "bindinn",
    "author": {
      "name": "Telly Filmy",
      "avatarUrl": "/Public/bindi.jpeg"
    },
    "date": "2025-09-17T16:59:38.877Z",
    "views": 0
  }, 
  {
    "title": "No one plays the non-fiction game like COLORS!",
    "excerpt": " ",
    "content": "No one plays the non-fiction game like COLORS! With Bigg Boss 19 sparking conversations and Pati Patni Aur Panga winning hearts, COLORS rules the ratings.Stay Tuned to COLORS for more fun and exciting shows",
    "category": "Entertainment",
    "imageUrl": "/images/bb19.jpeg",
    "tags": [
      "News"
    ],
    "isTopStory": true,
    "isTrending": true,
    "imageHint": "custom image",
    "id": "14525fdsgf",
    "slug": "testing",
    "author": {
      "name": "Telly Filmy",
      "avatarUrl": "/Public/logo.png"
    },
    "date": "2025-09-17T16:59:38.877Z",
    "views": 0
  },

  {
    "title": "Dangal TV Channel Ranked No.1 on YouTube Globally",
    "excerpt": "Dangal TV Channel Ranked No.1 on YouTube Globally as per Tubular Leaderboard in Media & Entertainment and Films & Movies Categories ",
    "content": "Dangal TV, one of India’s leading entertainment brands, has set yet another benchmark on the global stage.",
    "category": "Entertainment",
    "imageUrl": "/images/post1.jpeg",
    "tags": [
      "News"
    ],
    "isTopStory": true,
    "isTrending": true,
    "imageHint": "custom image",
    "id": "27lrft5c1xz",
    "slug": "bb",
    "author": {
      "name": "Telly Filmy",
      "avatarUrl": "/Public/logo.png"
    },
    "date": "2025-09-17T16:59:38.877Z",
    "views": 0
  }
]